# CannotCopyDisplacementSetIntoOtherDocument Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DisplacementElementFailures..::..CannotCopyDisplacementSetIntoOtherDocument Property
BuiltInFailures..::..DisplacementElementFailures Class See Also
---
A Displacement Set can only be pasted into a view in the same document in which it was created.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCopyDisplacementSetIntoOtherDocument { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCopyDisplacementSetIntoOtherDocument As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCopyDisplacementSetIntoOtherDocument {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DisplacementElementFailures Class
Autodesk.Revit.DB Namespace